касса_Вегас/src/Catalogs/ВидыОбъектовЕГАИС/ВидыОбъектовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбъектовЕГАИС</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ДокументыЕГАИС</name>
      <description>Документы</description>
    </items>
    <items>
      <name>СправочникиЕГАИС</name>
      <description>Справочники</description>
    </items>
  </predefined>
  <attributes>
    <name>ПространствоИмен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/Catalogs/ВидыОбъектовЕГАИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает (обновляет) элемент справочника, соответствующий виду объекта ЕГАИС.
//
// Параметры:
//  Имя                     - Строка - имя объекта ЕГАИС,
//  ПространствоИмен        - Строка - пространство имен объекта ЕГАИС,
//  ПрефиксПространстваИмен - Строка - префикс пространства имен объекта ЕГАИС,
//  ПутьНаСервере           - Строка - путь в ТМ ЕГАИС к объекту,
//  Родитель                - Строка - имя родителя объекта ЕГАИС.
//
Процедура ЗаполнитьПредопределенныйЭлемент(Имя, ПространствоИмен, ПрефиксПространстваИмен, ПутьНаСервере) Экспорт
	
	Попытка
		ВидОбъекта = ОбщегоНазначенияВызовСервера.ПредопределенныйЭлемент("Справочник.ВидыОбъектовЕГАИС." + Имя);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ВидыОбъектовЕГАИС." + Имя);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Если ВидОбъекта = Неопределено Тогда
		ВидОбъекта = Справочники.ВидыОбъектовЕГАИС.СоздатьЭлемент();
		ВидОбъекта.ИмяПредопределенныхДанных = Имя;
	Иначе
		ВидОбъекта = ВидОбъекта.ПолучитьОбъект();
	КонецЕсли;
	
	ВидОбъекта.Наименование = ИнтеграцияЕГАИСКлиентСервер.Синоним(Имя);
	ВидОбъекта.ПространствоИмен = ПространствоИмен;
	ВидОбъекта.ПрефиксПространстваИмен = ПрефиксПространстваИмен;
	ВидОбъекта.ПутьНаСервере = ПутьНаСервере;
	ВидОбъекта.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
